[
  {
    "fact": "All dogs can be traced back 40 million years ago to a weasel-like animal called the Miacis which dwelled in trees and dens. The Miacis later evolved into the Tomarctus, a direct forbear of the genus Canis, which includes the wolf and jackal as well as the dog."
  },
  {
    "fact": "Ancient Egyptians revered their dogs. When a pet dog would die, the owners shaved off their eyebrows, smeared mud in their hair, and mourned aloud for days."
  },
  {
    "fact": "Small quantities of grapes and raisins can cause renal failure in dogs. Chocolate, macadamia nuts, cooked onions, or anything with caffeine can also be harmful."
  },

  {
    "fact": "Dogs don’t go into menopause and will continue to go on heat indefinitely unless they are spayed."
  },
  { "fact": "Male dogs have a bone in their penis." },
  { "fact": "Wolves and dogs can mate to produce fertile offspring." },
  { "fact": "Dogs normally have between one to sixteen or even more puppies." },
  {
    "fact": "It is not possible to know how many puppies a dog will have just by looking. The appearance can be very deceptive."
  },
  {
    "fact": "Puppies are born deaf and cannot hear until they are about 21 days old. The young are born small, blind and helpless and require a long period of parental care."
  },
  { "fact": "Most dogs have 42 teeth." },
  { "fact": "Corgi is Welsh for \"dwarf dog\"." },
  { "fact": "Greyhounds can reach a speed of up to 45 miles per hour." },
  {
    "fact": "The most popular breed of domestic dog in the US and the UK is the Labrador Retriever."
  },
  {
    "fact": "The border collie or sheep dog is often considered to be the most intelligent breed of dog some of them have been trained to recognize the words for up to 1,000 objects and retrieved them by verbal command."
  },
  { "fact": "Dogs can discriminate the emotional expressions of human faces." },
  { "fact": "The largest breed of dog is the Irish Wolfhound." },
  {
    "fact": "Dogs do not have an appendix. Why haven’t humans gotten rid of theirs yet?"
  },
  { "fact": "Dogs are all direct descendants of wolves." },
  {
    "fact": "A dog’s heart beats up to 120 times per minute, or 50 faster than the average human heartbeat of 80 times per minute."
  }
]
